In [3]:
%matplotlib inline
import pandas as pd
import seaborn as sns

In [4]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [5]:
titles.title.value_counts().sum()

244914

In [6]:
# so we have total 244914 movies listed

### What are the earliest two films listed in the titles dataframe?

In [7]:
titles.sort_values('year',ascending=True).head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

In [8]:
#so the earliest two movies are as 'Miss jerry' and 'The Startled Lover'

### How many movies have the title "Hamlet"?

In [9]:
titles[titles['title']=='Hamlet'].sum()

title    HamletHamletHamletHamletHamletHamletHamletHaml...
year                                                 39494
dtype: object

In [10]:
# total we have 39494 'Hamlet' name in dataset

### How many movies are titled "North by Northwest"?

In [11]:

titles[titles['title']=="North by Northwest"].sum()

title    North by Northwest
year                   1959
dtype: object

In [12]:
#total we have 1959 movies with 'North by Northwest'

### When was the first movie titled "Hamlet" made?

In [13]:
x=titles.sort_values('year')

x[x['title']=='Hamlet'].head(1)

# as we can see first movie titled 'Hamlet' in 1910

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [14]:
z=titles.sort_values('year')
z[z['title']=='Treasure Island']

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [15]:
x[x['year']==1950].count()  # total 1113 movies has been made

title    1113
year     1113
dtype: int64

### How many movies were made in the year 1960?

In [20]:
x[x['year']==1960].count()  # total 1549 movies has been made

title    1549
year     1549
dtype: int64

### How many movies were made from 1950 through 1959?

In [38]:
titles[(titles['year']>=1950) & (titles['year']<=1959)].count() # can see total 12934 movies were made in this duration

title    12934
year     12934
dtype: int64

### In what years has a movie titled "Batman" been released?

In [47]:
sorted_movies=x

sorted_movies[sorted_movies['title']=='Batman'].head(1)

# first batman movies has been released in 1943

        title  year
39349  Batman  1943

### How many roles were there in the movie "Inception"?

In [52]:
cast=pd.read_csv('cast.csv') 
cast.head() # new dataset has been inserted

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [57]:

cast[cast['title']=='Inception']['character'].count()

# there are 78 roles were in the movie of inception

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [60]:
cast.n.isnull().count()

3786176

In [70]:
cast[cast['title']=='Inception']['n'].isna().sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [72]:
cast[cast['title']=='Inception'].count()
#since count() function count only values and ignore na values

title        78
year         78
name         78
type         78
character    78
n            51
dtype: int64

In [73]:
#there are 51 'n' value which are recieved

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [77]:
order_cast=cast.sort_values(by='n')

In [83]:
order_cast[order_cast['title']=='North by Northwest']['n'].dropna()

# we have removed na values and sorted data also.

871426      1.0
3518333     2.0
1457165     3.0
3157232     4.0
356707      5.0
3048272     6.0
1695173     7.0
1275337     8.0
2447081     9.0
1811387    10.0
665768     11.0
2295714    12.0
464736     13.0
1508344    14.0
206471     15.0
1384780    16.0
Name: n, dtype: float64

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [87]:
order_cast[(order_cast.title=='Sleuth') & (order_cast.year==1972)].sort_values(by='n')

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

In [88]:
# above are sorted value bu n with all charactor and 1972 year only

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [91]:
order_cast[(order_cast.title=='Sleuth') & (order_cast.year==2007)].sort_values(by='n')

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

In [92]:
# above are sorted value bu n with all charactor and 2007 year only

### How many roles were credited in the silent 1921 version of Hamlet?

In [111]:
order_cast[(order_cast['title']=='Hamlet') & (order_cast['year']==1921)]['character'].count()

9

In [143]:
# total 9 roles create

### How many roles were credited in Branagh’s 1996 Hamlet?

In [144]:
order_cast[(order_cast['title']=="Hamlet") & (order_cast['year']==1996)]['character'].count()

54

In [145]:
# total 54 roles created

### How many "Hamlet" roles have been listed in all film credits through history?

In [220]:
year_sorted[year_sorted.title=='Hamlet']['type'].value_counts().sum()

342

In [221]:
# TOTAL 342 roles has created

### How many people have played an "Ophelia"?

In [222]:
order_cast[order_cast['title']=="Ophelia"]['character'].count()

20

In [147]:
#there are 20 people have played an ophelia

### How many people have played a role called "The Dude"?

In [148]:
order_cast[order_cast['title']=="The Dude"]['character'].count()

0

### How many people have played a role called "The Stranger"?

In [149]:
order_cast[order_cast['title']=="The Stranger"]['character'].count()

106

In [150]:
#106 people had play

### How many roles has Sidney Poitier played throughout his career?

In [156]:
order_cast[order_cast['name']=='Sidney Poitier'].count()

title        43
year         43
name         43
type         43
character    43
n            42
dtype: int64

In [157]:
# there are 43 roles has been played by himb in his career

### How many roles has Judi Dench played?

In [158]:
order_cast[order_cast['name']=='Judi Dench'].count()

title        55
year         55
name         55
type         55
character    55
n            51
dtype: int64

In [159]:
# there are 55 roles has been played by himb in his career

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [167]:
year_sorted=cast.sort_values('year')
year_sorted[(year_sorted.year==1940) & (year_sorted.name=='Cary Grant') & (year_sorted.n==2)]

                   title  year        name   type   character    n
871423  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

In [172]:
# Cary Grant has total one with 2 n class

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [173]:
year_sorted[(year_sorted.year==1940) & (year_sorted.name=='Cary Grant')]

,title,year,name,type,character,n
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871423,My Favorite Wife,1940,Cary Grant,actor,Nick Arden,2.0
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0

In [174]:
# above are list

### How many roles were available for actors in the 1950s?

In [211]:
role=cast[(cast.type=='actor') & (cast.year==1950)].count()
print(role['type'])

16760

In [213]:
# in 1950 there were 16760 roles

### How many roles were available for actresses in the 1950s?

In [214]:
role=cast[(cast.type=='actress') & (cast.year==1950)].count()
print(role['type'])

5637

In [215]:
# in 1950 there were 5637 roles

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [225]:
year_sorted[(year_sorted.year==1980) & (year_sorted.n==1)].count()

title        1183
year         1183
name         1183
type         1183
character    1183
n            1183
dtype: int64

In [226]:
# total 1183 roles has been created

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [251]:
year_sorted[(year_sorted.year==1980) & (year_sorted.n)].isna().count()

title        19006
year         19006
name         19006
type         19006
character    19006
n            19006
dtype: int64

In [252]:
# total 19006 values were